function findVerse (verse) {
    const data = ["به لاله نرگس مخمور گفت وقت سحر - که هر که در صف باغ است صاحب هنریست","ای خوشا مستانه سر در پای دلبر داشتن - دل تهی از خوب و زشت چرخ اخضر داشتن","کبوتر بچه‌ای با شوق پرواز - بجرئت کرد روزی بال و پر باز","مرغی نهاد روی به باغی ز خرمنی - ناگاه دید دانه لعلی به روزنی","بابا","عدسی وقت پختن، از ماشی - روی پیچید و گفت این چه کسی است","تا به کی جان کندن اندر آفتاب ای رنجبر - ریختن از بهر نان از چهر آب ای رنجبر","خمید نرگس پژمرده‌ای ز انده و شرم - چو دید جلوه گلهای بوستانی را","نهان شد از گل زردی گلی سپید که ما - سپید جامه و از هر گنه مبرائیم","حکایت کرد سرهنگی به کسری - که دشمن را ز پشت قلعه راندیم","شبی بمردمک چشم، طعنه زد مژگان - که چند بی سبب از بهر خلق کوشیدن","چو رنگ از رخ روز، پرواز کرد - شباویز، نالیدن آغاز کرد","زاغی به طرف باغ، به طاووس طعنه زد - کین مرغ زشت روی چه خودخواه و خودنماست","گربه پیری، ز شکار اوفتاد - زار بنالید و نزار اوفتاد","یکی گوهر فروشی، ثروت اندوز - بدست آورد الماسی دل افروز","دزد عیاری، بفکر دستبرد - گاه ره میزد، گهی ره میسپرد"];


    for(let i = 0 ; i < data.length ; i++){
            //  console.log(lastWord)
            //  console.log(verse[0])
            // console.log(verse[0] === data[2][3]);
            // if(verse[0] === lastWord){
            //    console.log(data[i])
            // }
            // console.log(data[i][0])
            // console.log(verse[verse.length - 1])
            if(verse[verse.length - 1] === data[i][0]){
                console.log(data[i]);
            }else{
                console.log('بیتی پیدا نشد.');
            }
     
    }
}

findVerse('گل سرخ، روزی ز گرما فسرد - فروزنده خورشید، رنگش ببرد');